app/controllers/cinema_timetables_controller.rb

  def index
    @cinema_timetables = CinemaTimetable.all
---
SELECT "cinema_timetables".* FROM "cinema_timetables"

  def create
    @cinema_timetable = CinemaTimetable.new(cinema_timetable_params)

    respond_to do |format|
      if @cinema_timetable.save
---
INSERT INTO "cinema_timetables" ("cinema_id", "movie_id", "hall", "start", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cinema_id", 1], ["movie_id", 1], ["hall", "Сатурн"], ["start", "2016-05-06 10:50:00.000000"], ["created_at", "2016-05-05 18:02:21.137309"], ["updated_at", "2016-05-05 18:02:21.137309"]]

  def update
    respond_to do |format|
      if @cinema_timetable.update(cinema_timetable_params)
---
UPDATE "cinema_timetables" SET "hall" = $1, "updated_at" = $2 WHERE "cinema_timetables"."id" = $3  [["hall", "Северная Аxdvvv"], ["updated_at", "2016-05-20 15:32:20.633459"], ["id", 1]]

    def set_cinema_timetable
      @cinema_timetable = CinemaTimetable.find(params[:id])
---
SELECT  "cinema_timetables".* FROM "cinema_timetables" WHERE "cinema_timetables"."id" = $1 LIMIT 1  [["id", 1]]