app/controllers/movie_companies_controller.rb

SELECT "movie_companies".* FROM "movie_companies"
---
  def index
    @movie_companies = MovieCompany.all

INSERT INTO "movie_companies" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Marvel"], ["created_at", "2016-05-05 17:23:54.877669"], ["updated_at", "2016-05-05 17:23:54.877669"]]
---
  def create
    @movie_company = MovieCompany.new(movie_company_params)

    respond_to do |format|
      if @movie_company.save

SELECT  "movie_companies".* FROM "movie_companies" WHERE "movie_companies"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_movie_company
      @movie_company = MovieCompany.find(params[:id])