app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("name", "min_age", "genre", "duration", "movie_company_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Avangers"], ["min_age", 16], ["genre", 1], ["duration", 180], ["movie_company_id", 1], ["created_at", "2016-05-05 17:37:49.658812"], ["updated_at", "2016-05-05 17:37:49.658812"]]